{
  "posts": [
    {
      "title": "ЯЗЫКИ ПРОГРАММИРОВАНИЯ С НУЛЯ",
      "category": "Frontend",
      "description": "Как Работает Javascript Это два других языка, которые используются для создания веб-сайтов. Однако, если вы хотите сделать сайт интерактивным и добавить контент, который обновляется динамически, вам необходимо использовать JavaScript. JavaScript также применяется как скриптовый язык на стороне сервера. JavaScript сервер предоставляет объекты среды, представляющие объекты HTTP запросов и ответов, которые могут быть использованы программой на JavaScript для динамической генерации веб-страниц. JavaScript запускается на стороне клиента Интернета, который может использоваться для создания/программирования того, как веб-страницы будут вести себя при наступлении каких-либо событий. JavaScript легко изучить, а также это мощный скриптовый язык, широко используемый для контролирования поведения веб-страниц.",
      "author": "Chingiz",
      "text": "Содержание\n\nОбработчики Событий В Html\nКак Работает Javascript\nСтоит Ли Новичкам Осваивать Js\nУскоренный Курс По Основам Языка\nРазберитесь С Node Js\nВ конце мы устанавливаем textContentзаголовку в виде строки и имени пользователя. JavaScript — один из тех языков программирования, которые можно просто освоить без опыта. Он используется для веб-разработки, на нем можно создавать серверные приложения, 3D-игры и даже программировать робототехнику. Автор блога SkillFactory Максим Рудик рассказывает, с чего начать изучение JavaScript. Однако обычно в HTML-атрибуты обработчиков событий включаются простые инструкции присваивания или простые вызовы функций, объявленных где-то в другом месте.\n\nНевозможно это сделать как раз потому, что PHP-скрипты обрабатываются на сервере, а в браузер передается уже готовый, обработанный вариант. Наш сайт всегда расположен на каком-либо сервере, т.е. Мощном компьютере, специально предназначенном для размещения на нем сайтов многих людей. В случае с серверными языками (к которым и относится PHP) мы наблюдаем другую картину.\n\nВажно понимать, что CSS-файл – это обычный текстовый файл. В нем пишутся специальные инструкции, описывающие внешний вид элемента и его позиционирование на странице а также комментарии (произвольные пояснения относительно написанных инструкций). Однако такой подход считается неверным и устаревшим, т.к. Для задания внешнего вида существует отдельный язык. В заключение хочу отметить также тот факт, что средствами HTML все же можно управлять не только логической структурой веб-страниц, но и некоторыми аспектами ее внешнего вида. Также следует упомянуть о том, что существует еще и язык XHTML.\n\nСхожесть между языками есть, прежде всего, по синтаксису.\nОн может быть использован, чтобы скрыть информацию и раскрывать ее при действии пользователя.\nЭти инструменты предоставляют ряд встроенных функций, расширяющих возможности использования инфраструктуры JavaScript.\nМы также включим возможность изменить пользователя и, следовательно, приветственное сообщение, в любое время, когда это будет необходимо.\nC ее помощью можно полностью реализовать backend веб-приложения. Для полноценного освоения клиентской части будет достаточно базовых знаний Node.js. Базовый курс по JavaScript от MDN Web Docks, крупнейшего ресурса, посвященного веб-разработке. Одно из ранних использований JavaScript-кода в диалоговом окне сообщений, предусмотренных предупреждениях, оповещениях или приглашениях пользователям.\n\nAPI – это готовые наборы блоков кода, которые позволяют разработчику реализовывать программы, которые в противном случае было бы трудно или невозможно реализовать. CSS – это язык стилей с помощью которого мы придаём стиль отображения нашего HTML контента, например придаём цвет фону и шрифту, придаём контенту многоколоночный вид. Создание сайта логично начать со статичных страниц на HTML и CSS, а потом оживить их при помощи JavaScript.\n\nДля наглядности приведем два примера типичных сценариев. Онлайн-обучение – самая удобная и эффективная форма освоения Javascript. Можно начать с общей информации и наглядных примеров, которые очень впечатляют.\n\nОбработчики Событий В Html\nНаконец, SQL позволяет нам организовать взаимодействие сайта с базой данных, что и позволяет нам, в связке с языком PHP создавать действительно мощные, функциональные сайты. Для добавления JavaScript-кода на страницу можно использовать тэг script. Его рекомендуется помещать внутри тэга head, хотя это и не обязательно.",
      "views": 7,
      "id": 1
    },
    {
      "title": "Web Design С Чего Начать",
      "category": "Frontend",
      "description": "Попутно очень полезно смотреть на лучшие образцы дизайнерского творчества. Потом можно попробовать сделать что-то аналогичное своими силами. И всегда надо верить, что у вас все получится!  Учитываются требования дальнейшей верстки и программирования. Специализируется на UX/UI дизайне сайтов, разработке интерфейсов мобильных приложений, разработке фирменного стиля. Двигаясь от простого к сложному, вы станете профессиональным веб-дизайнером и сможете дорасти до руководителя, возглавляющего самостоятельный интернет-проект. Сейчас в интернете сложилась любопытная ситуация. Поисковик предлагает более 20 вариантов школ и курсов веб-дизайна в Минске, каждый из которых выпускает хотя бы по 3 потока ежегодно.",
      "author": "Chingiz",
      "text": "Потребовались курсы по созданию сайтов в Казани?\nСегодня дизайн любого успешного сайта строится по принципам швейцарской типографики.\nИ никто вам не даст хорошего совета об этом, кроме вас самих!\nНа этой стадии осуществляются действия, способствующие распространению и эффективной доставки сайта по сети.\nЗа это время вы погружаетесь в профессию, проходите стажировку и по окончании становитесь дипломированным веб-дизайнером. В этом вам помогут педагоги, которые сочетают преподавание в школе с работой в крупнейших интернет-компаниях Нижнего Новгорода. Двигаясь от простого к сложному, вы станете профессиональным веб-дизайнером и дорасти до руководителя, возглавляющего самостоятельный интернет-проект.\n\nВместе с преподавателем вы пройдете все этапы создания сайт от разработки макета до размещения на хостинге. Отправляя свои данные, вы даёте согласие на обработку ваших персональных данных всоответствии с 152-ФЗ. Копирайтер, переводчик и редактор.\n\nКак Записаться На Обучение На Курсы:\nСовременный веб-дизайн это не только проектирование и создание внешнего вида сайта в графическом виде, но и его верстка с использованием языков HTML и CSS. Веб-дизайн для начинающих будет более эффективен в освоении, если полученные теоретические знания вы зразу же сможете закрепить на практике. Для этого можно как экспериментировать с самостоятельным созданием элементов и шаблонов, так и работать с чужими исходниками. В Интернете есть множество сайтов, на которых можно скачать бесплатные графические исходники, причем, довольно высокого качества. Решив начать обучение веб-дизайну, следует знать, что веб-дизайн – это отдельная огромная отрасль знаний со своими правилами и законами.\n\nХотя бывает много случаев, когда человек хочет заняться именно , а без знаний создания графического движка сайта программировать его непросто. Познакомиться с курсом и рассмотреть специальности «верстальщик» и «веб-дизайнер» в контексте развития технологий. Только все необходимое человеку, который пришёл на курсы веб-дизайна с нуля и хочет начать зарабатывать деньги. Салют, меня зовут Денис, я занимаюсь веб-дизайном и с удовольствием учу создавать сильные и стильные сайты. На этом уроке мы создаем прототип своего сайта.",
      "views": 6,
      "id": 2
    },
    {
      "title": "Шаг 5 Выбор Базы Данных",
      "category": "Backend",
      "description": "Колоночная Субд Scylla Неважно, создаете вы ИТ-проект с нуля или ищете альтернативу текущему решению — вам нужно будет решать, какую базу данных выбрать. Мы давно думали о том, как облегчить выбор СУБД для проектов. Так появился тест, в котором мы собрали свой опыт, а также опыт пользователей Облака. Всего четыре вопроса — и вы сможете понять, какая база вам подходит лучше всего. Redis — может быть использован как самостоятельная СУБД для быстрой работы с небольшими объемами данных либо как кэширующий слой для работы с другой СУБД, то есть как замена memcached. Помогает ускорить работу медленной базы данных, увеличивает скорость обработки запросов.",
      "author": "Chingiz",
      "text": "Что Такое Реляционные И Нереляционные Базы Данных\nКолоночная Субд Scylla\nMicrosoft Sql Server\nЛучший Выбор Базы Данных Для Моего Приложения C#\nСайтов Для Оттачивания Навыков Написания Sql\nВыбор Базы Данных\nТипов Современных Баз Данных: Предназначение, Достоинства И Недостатки\nПоэтому, если вы в основном работаете над фактическим анализом, вам следует обратиться к базе данных, оптимизированной для аналитики, такой как Redshift или BigQuery. Такие базы данных спроектированы так, чтобы вместить большой объем данных и быстро считывать и объединять данные, что делает запросы быстрыми. Они также могут загружать данные достаточно быстро (ежечасно), пока кто-то выполняет процесс очистки, изменяет размер и мониторит кластер.\n\nПод согласованностью имеется в виду запись в БД только той информации, которая соответствует всем правилам. Если входные данные не указаны, сервер БД SQL возвращается в исходное состояние до проведения транзакции. Это позволяет исключить повреждения базы данных при проведении транзакции с ошибкой. Практически любую задачу можно выполнить практически с любым типом базы данных. Вопрос в том, насколько это будет дорого и оптимизировано.\n\nшаг 5  выбор базы данных\n\nЕсли мы хотим получить доступ к данным с помощью фильтра по любому значению и даже по любому слову в столбце, мы должны вспомнить про поисковые системы. Эти базы данных выполняют индексацию каждого слова в столбцах и позволяют выполнять полнотекстовый поиск. Они идеально подходят для хранения и анализа журналов или больших текстовых значений. Если вы когда-либо работали с базами данных, скорее всего, вы начали с этого типа, потому что он самый популярный и распространенный. Такие БД позволяют хранить данные в реляционных таблицах с определенными столбцами определенного типа.\n\nЧто Такое Реляционные И Нереляционные Базы Данных\nНапример, можно использовать в качестве основной базы MySQL, а для кеша — Redis. Он способен работать с разными типами данных, оперативно обрабатывает их в памяти, умеет сохранять на диске, отличается простой репликацией данных. MongoDB — опенсорсная база данных документного типа.",
      "views": 15,
      "id": 3
    }
  ],
  "users": [
    {
      "firstName": "Chingiz",
      "lastName": "Shigayev",
      "email": "admin@gmail.com",
      "password": "admin123",
      "confirm": "admin123",
      "id": 1
    },
    {
      "firstName": "Chingiz",
      "lastName": "Shigayev",
      "email": "shigayevphone@gmail.com",
      "password": "admin123",
      "confirm": "admin123",
      "id": 2
    }
  ],
  "categories": [
    {
      "title": "Frontend",
      "description": "Данный раздел посвящен различным технологиям веб-программирования. К ним можно отнести HTML5, CSS3, язык JavaScript, платформу Node.js, а также различные фреймворки - jQuery, Angular, React, Vue.js, Ext JS и т.д. В настоящее время подобные технологии быстро развиваются, они дают разработчикам все больше возможностей, а их производительность растет. В итоге уменьшаются преимущества подобных нативных приложений, а разработка все больше уходит в веб-среду.\n\nБез использования специальных библиотек javascript не обходится ни одно крупное веб-приложение. В качестве альтернативы в последнее время все чаще используется язык TypeScript, который компилируется в JavaScript.\n\nТакже существуют различные фреймворки, которые используют JavaScript или TypeScript: Angular, React, Vue.js.\n\nИспользование технологии WebGL дает возможность создавать высокопроизводительные приложения с трехмерной графикой прямо в браузере вне зависимости от целевой платформы.",
      "id": 1
    },
    {
      "title": "Backend",
      "description": "Данный раздел посвящен языку программирования C# и платформе .NET. Доступые подразделы:\n\nОбщая тематика\nПолное руководство по C# 10 и .NET 6\nДанное руководство призвано помочь в короткие сроки освоить все основные концепции языка программирования C#.\n\nПаттерны проектирования\nРуководство раскрывает возможности языка на более высоком уровне и покрывает все основные паттерны проектирования на C#.\n\nСетевое программирование в С# и .NET\nСоздание сетевых приложений (TCP/UDP/HTTP) на C#.\n\nАлгоритмы и структуры данных\nРазбор базовых структур данных и их построение на C#.\n\nВопросы для самопроверки\nВопросы для самопроверки полученных знаний по C#/.NET.\n\nСобеседование по C# и .NET\nВопросы с собеседований по C# и .NET. Уровень - Junior/Middle Developer.",
      "id": 2
    },
    {
      "title": "QA",
      "description": "Что же такое QA и как овладеть профессией тестировщика ПО,чтобы реализовать себя в IT-отрасли?\n\nСамое важное, что нужно сделать перед тем, как вести разговор, что такое Quality Assurance (QA) — это разобраться с терминологией. Большинство не различает между собой термины Quality Assurance (QA), Quality Control (QC) и просто Тестирование, считая их синонимами.\n\nОбеспечение качества (Quality Assurance) — самое широкое из всех понятий и представляет собой совокупность мероприятий, охватывающих абсолютно все этапы разработки, выпуска и эксплуатации программного обеспечения. Это активности на всех этапах жизненного цикла ПО, которые предпринимаются для обеспечения требуемого уровня качества выпускаемого продукта.\n\nКонтроль качества (Quality Control) — это действия, проводимые над продуктом в процессе разработки, для получения информации о его актуальном состоянии: насколько продукт готов и соответствует ли он требованиям качества в каждый конкретный промежуток времени.\n\nТестирование программного обеспечения (Software Testing) — это одна из техник контроля качества, включающая в себя активности по планированию тестовых действий, дизайну тестов, выполнению этих тестов и анализу полученных данных.",
      "id": 3
    }
  ]
}