{
  "posts": [
    {
      "title": "ЯЗЫКИ ПРОГРАММИРОВАНИЯ С НУЛЯ",
      "category": "Frontend",
      "description": "Как Работает Javascript Это два других языка, которые используются для создания веб-сайтов. Однако, если вы хотите сделать сайт интерактивным и добавить контент, который обновляется динамически, вам необходимо использовать JavaScript. JavaScript также применяется как скриптовый язык на стороне сервера. JavaScript сервер предоставляет объекты среды, представляющие объекты HTTP запросов и ответов, которые могут быть использованы программой на JavaScript для динамической генерации веб-страниц. JavaScript запускается на стороне клиента Интернета, который может использоваться для создания/программирования того, как веб-страницы будут вести себя при наступлении каких-либо событий. JavaScript легко изучить, а также это мощный скриптовый язык, широко используемый для контролирования поведения веб-страниц.",
      "author": "Chingiz",
      "text": "Содержание\n\nОбработчики Событий В Html\nКак Работает Javascript\nСтоит Ли Новичкам Осваивать Js\nУскоренный Курс По Основам Языка\nРазберитесь С Node Js\nВ конце мы устанавливаем textContentзаголовку в виде строки и имени пользователя. JavaScript — один из тех языков программирования, которые можно просто освоить без опыта. Он используется для веб-разработки, на нем можно создавать серверные приложения, 3D-игры и даже программировать робототехнику. Автор блога SkillFactory Максим Рудик рассказывает, с чего начать изучение JavaScript. Однако обычно в HTML-атрибуты обработчиков событий включаются простые инструкции присваивания или простые вызовы функций, объявленных где-то в другом месте.\n\nНевозможно это сделать как раз потому, что PHP-скрипты обрабатываются на сервере, а в браузер передается уже готовый, обработанный вариант. Наш сайт всегда расположен на каком-либо сервере, т.е. Мощном компьютере, специально предназначенном для размещения на нем сайтов многих людей. В случае с серверными языками (к которым и относится PHP) мы наблюдаем другую картину.\n\nВажно понимать, что CSS-файл – это обычный текстовый файл. В нем пишутся специальные инструкции, описывающие внешний вид элемента и его позиционирование на странице а также комментарии (произвольные пояснения относительно написанных инструкций). Однако такой подход считается неверным и устаревшим, т.к. Для задания внешнего вида существует отдельный язык. В заключение хочу отметить также тот факт, что средствами HTML все же можно управлять не только логической структурой веб-страниц, но и некоторыми аспектами ее внешнего вида. Также следует упомянуть о том, что существует еще и язык XHTML.\n\nСхожесть между языками есть, прежде всего, по синтаксису.\nОн может быть использован, чтобы скрыть информацию и раскрывать ее при действии пользователя.\nЭти инструменты предоставляют ряд встроенных функций, расширяющих возможности использования инфраструктуры JavaScript.\nМы также включим возможность изменить пользователя и, следовательно, приветственное сообщение, в любое время, когда это будет необходимо.\nC ее помощью можно полностью реализовать backend веб-приложения. Для полноценного освоения клиентской части будет достаточно базовых знаний Node.js. Базовый курс по JavaScript от MDN Web Docks, крупнейшего ресурса, посвященного веб-разработке. Одно из ранних использований JavaScript-кода в диалоговом окне сообщений, предусмотренных предупреждениях, оповещениях или приглашениях пользователям.\n\nAPI – это готовые наборы блоков кода, которые позволяют разработчику реализовывать программы, которые в противном случае было бы трудно или невозможно реализовать. CSS – это язык стилей с помощью которого мы придаём стиль отображения нашего HTML контента, например придаём цвет фону и шрифту, придаём контенту многоколоночный вид. Создание сайта логично начать со статичных страниц на HTML и CSS, а потом оживить их при помощи JavaScript.\n\nДля наглядности приведем два примера типичных сценариев. Онлайн-обучение – самая удобная и эффективная форма освоения Javascript. Можно начать с общей информации и наглядных примеров, которые очень впечатляют.\n\nОбработчики Событий В Html\nНаконец, SQL позволяет нам организовать взаимодействие сайта с базой данных, что и позволяет нам, в связке с языком PHP создавать действительно мощные, функциональные сайты. Для добавления JavaScript-кода на страницу можно использовать тэг script. Его рекомендуется помещать внутри тэга head, хотя это и не обязательно.",
      "views": 8,
      "id": 1
    },
    {
      "title": "Web Design С Чего Начать",
      "category": "Frontend",
      "description": "Попутно очень полезно смотреть на лучшие образцы дизайнерского творчества. Потом можно попробовать сделать что-то аналогичное своими силами. И всегда надо верить, что у вас все получится!  Учитываются требования дальнейшей верстки и программирования. Специализируется на UX/UI дизайне сайтов, разработке интерфейсов мобильных приложений, разработке фирменного стиля. Двигаясь от простого к сложному, вы станете профессиональным веб-дизайнером и сможете дорасти до руководителя, возглавляющего самостоятельный интернет-проект. Сейчас в интернете сложилась любопытная ситуация. Поисковик предлагает более 20 вариантов школ и курсов веб-дизайна в Минске, каждый из которых выпускает хотя бы по 3 потока ежегодно.",
      "author": "Chingiz",
      "text": "Потребовались курсы по созданию сайтов в Казани?\nСегодня дизайн любого успешного сайта строится по принципам швейцарской типографики.\nИ никто вам не даст хорошего совета об этом, кроме вас самих!\nНа этой стадии осуществляются действия, способствующие распространению и эффективной доставки сайта по сети.\nЗа это время вы погружаетесь в профессию, проходите стажировку и по окончании становитесь дипломированным веб-дизайнером. В этом вам помогут педагоги, которые сочетают преподавание в школе с работой в крупнейших интернет-компаниях Нижнего Новгорода. Двигаясь от простого к сложному, вы станете профессиональным веб-дизайнером и дорасти до руководителя, возглавляющего самостоятельный интернет-проект.\n\nВместе с преподавателем вы пройдете все этапы создания сайт от разработки макета до размещения на хостинге. Отправляя свои данные, вы даёте согласие на обработку ваших персональных данных всоответствии с 152-ФЗ. Копирайтер, переводчик и редактор.\n\nКак Записаться На Обучение На Курсы:\nСовременный веб-дизайн это не только проектирование и создание внешнего вида сайта в графическом виде, но и его верстка с использованием языков HTML и CSS. Веб-дизайн для начинающих будет более эффективен в освоении, если полученные теоретические знания вы зразу же сможете закрепить на практике. Для этого можно как экспериментировать с самостоятельным созданием элементов и шаблонов, так и работать с чужими исходниками. В Интернете есть множество сайтов, на которых можно скачать бесплатные графические исходники, причем, довольно высокого качества. Решив начать обучение веб-дизайну, следует знать, что веб-дизайн – это отдельная огромная отрасль знаний со своими правилами и законами.\n\nХотя бывает много случаев, когда человек хочет заняться именно , а без знаний создания графического движка сайта программировать его непросто. Познакомиться с курсом и рассмотреть специальности «верстальщик» и «веб-дизайнер» в контексте развития технологий. Только все необходимое человеку, который пришёл на курсы веб-дизайна с нуля и хочет начать зарабатывать деньги. Салют, меня зовут Денис, я занимаюсь веб-дизайном и с удовольствием учу создавать сильные и стильные сайты. На этом уроке мы создаем прототип своего сайта.",
      "views": 8,
      "id": 2
    },
    {
      "title": "Шаг 5 Выбор Базы Данных",
      "category": "Backend",
      "description": "Колоночная Субд Scylla Неважно, создаете вы ИТ-проект с нуля или ищете альтернативу текущему решению — вам нужно будет решать, какую базу данных выбрать. Мы давно думали о том, как облегчить выбор СУБД для проектов. Так появился тест, в котором мы собрали свой опыт, а также опыт пользователей Облака. Всего четыре вопроса — и вы сможете понять, какая база вам подходит лучше всего. Redis — может быть использован как самостоятельная СУБД для быстрой работы с небольшими объемами данных либо как кэширующий слой для работы с другой СУБД, то есть как замена memcached. Помогает ускорить работу медленной базы данных, увеличивает скорость обработки запросов.",
      "author": "Chingiz",
      "text": "Что Такое Реляционные И Нереляционные Базы Данных\nКолоночная Субд Scylla\nMicrosoft Sql Server\nЛучший Выбор Базы Данных Для Моего Приложения C#\nСайтов Для Оттачивания Навыков Написания Sql\nВыбор Базы Данных\nТипов Современных Баз Данных: Предназначение, Достоинства И Недостатки\nПоэтому, если вы в основном работаете над фактическим анализом, вам следует обратиться к базе данных, оптимизированной для аналитики, такой как Redshift или BigQuery. Такие базы данных спроектированы так, чтобы вместить большой объем данных и быстро считывать и объединять данные, что делает запросы быстрыми. Они также могут загружать данные достаточно быстро (ежечасно), пока кто-то выполняет процесс очистки, изменяет размер и мониторит кластер.\n\nПод согласованностью имеется в виду запись в БД только той информации, которая соответствует всем правилам. Если входные данные не указаны, сервер БД SQL возвращается в исходное состояние до проведения транзакции. Это позволяет исключить повреждения базы данных при проведении транзакции с ошибкой. Практически любую задачу можно выполнить практически с любым типом базы данных. Вопрос в том, насколько это будет дорого и оптимизировано.\n\nшаг 5  выбор базы данных\n\nЕсли мы хотим получить доступ к данным с помощью фильтра по любому значению и даже по любому слову в столбце, мы должны вспомнить про поисковые системы. Эти базы данных выполняют индексацию каждого слова в столбцах и позволяют выполнять полнотекстовый поиск. Они идеально подходят для хранения и анализа журналов или больших текстовых значений. Если вы когда-либо работали с базами данных, скорее всего, вы начали с этого типа, потому что он самый популярный и распространенный. Такие БД позволяют хранить данные в реляционных таблицах с определенными столбцами определенного типа.\n\nЧто Такое Реляционные И Нереляционные Базы Данных\nНапример, можно использовать в качестве основной базы MySQL, а для кеша — Redis. Он способен работать с разными типами данных, оперативно обрабатывает их в памяти, умеет сохранять на диске, отличается простой репликацией данных. MongoDB — опенсорсная база данных документного типа.",
      "views": 16,
      "id": 3
    },
    {
      "title": "Как Найти Первую Работу В It",
      "category": "QA",
      "description": "Собеседования Что Делать, Если В Моем Городе Нет Вакансий Java Программиста? Уровень Зарплаты В Зависимости От Опыта Работы Соискателя Глава Восьмая Почему Некоторые Не Могут Найти Работу? 1 Где Найти Удаленную Работу Программисту",
      "author": "Chingiz",
      "text": "Начальные умения девелоперы часто получают, выполняя задачи за небольшие деньги для старых знакомых, приятелей. Так они нарабатывают нужный навык, заполняют портфолио, создают себе положительную репутацию. Всегда помните, что не только вас выбирают, — программист тоже решает, хочет ли он работать именно в этой компании.\n\nПоймите, в какой сфере вам интересно развиваться. Решите, какой проект для вас — мечта. Задача рекрутера — найти человека под конкретную позицию. Если отказали, не нужно переживать — ваши навыки не подходят именно для этой вакансии.\n\nСобеседования\nНе жалуйтесь, не говорите об этом, не думайте об этом, просто делайте. Вы всегда будете думать, что вы идеально выполняете свою работу сейчас, но это не так. Со временем код становится лучше, а знания расширяются. Возможно, через месяц вы взглянете на свои нынешние программы и ужаснетесь или хорошенько над ними посмеетесь. Хотя время играет здесь определенную роль, оно не гарантирует истинную глубину знаний и не отличает хороших программистов от плохих.\n\nХотя время играет здесь определенную роль, оно не гарантирует истинную глубину знаний и не отличает хороших программистов от плохих.\nВ конце концов меня пригласили на собеседование в филиал одной датской компании, где я ответил на фундаментальные вопросы и приятно удивил всех своим английским.\nПриятно, когда за твое, по сути, хобби платят хорошие деньги.\nЦелыми днями я изучал алгоритмы сортировки.\nВполне можно устроиться программистом через такие каталоги.\nНе нужно вписывать фреймворки Zend, Symfony и другие, если ты с ними не работал. Первая и основная проблема, с которой сталкиваются новички, – резюме. Без адекватного, вас не будут приглашать на собеседования. Но как быть тем, у кого совсем нет опыта работы? Для того чтобы «не с пустыми руками» идти к HR, мы с моим другом вписали мне в резюме целый год опыта работы над его проектом, над которым мы якобы вместе трудились. Вы шлете резюме в компанию мечты, но вам даже не отвечают?\n\nТак же и со временем повышается заработная плата и не только. Зарекомендовав себя, вы будете иметь довольно хороший социальный пакет. При наличии опыта и солидных проектов за спиной, отсутствие профильного образования и вообще высшего – не является преградой. Ценятся опыт и реальные знания, а не наличие той или иной корочки. Разработка программного обеспечения – очень молодая область.\n\nЯ общался с любой фирмой, даже если не был особо заинтересован в вакансии. Приезжал на собеседование в офис в каждую компанию, куда меня приглашали. Задавал вопросы, выспрашивал хоть какую-нибудь информацию о проектной организации команды, используемых технологиях и инструментах, задачах компании и архитектуре системы. – сервис удаленной работы для дизайнеров, программистов и т. Уже на главной странице вы можете познакомиться со всеми проектами, поступившими на сервис на данный момент. Если вас заинтересовало какое-то предложение, то кликните по его названию, чтобы более подробно ознакомиться со всеми деталями.\n\nСтремление к обучению поможет вам продвинуться вперед. Программист работает над программным продуктом не в одиночку. Есть исключения, конечно, но если речь идет о крупном продукте, то это именно так.\n\nСоставляя резюме, нужно выделить свои сильные стороны, но не стоит ничего преувеличивать — все равно на собеседовании вскроется ваш реальный уровень. «Тут главное не перестараться и не вызвать завышенных ожиданий у интервьюеров», — подтверждает Сергей Кучмий. «Компании-гиганты сами заинтересованы в талантливом молодняке с горящими глазами и открытыми сердцами», — говорит Марк Кандауров, ведущий it рекрутер Spice IT Recruitment. По мне, это кажется очевидным. Если ты идешь в японскую компанию, тебе надо настраиваться на их менталитет, потому что обычно в коллективе мало иностранцев, и ты будешь чествовать себя не в своей тарелке.\n\nПодработки дают возможность работать на множество разных людей и над множеством разных проектов. Это отличная возможность провести исследование и узнать, что вам нравится. Любое взаимодействие я расценивал как возможность чему-то научиться — улучшить технические навыки, навыки самопрезентации и собеседования.\n\nФрилансдляпрограммиста— это еще и способ показать рекрутеру, чтовы заняли активную позицию и стучитесь во все двери. Попробуйте войти в IT через фриланс — это проще, чем сразу устроиться в корпорацию. Зарекомендуйте себя как хорошего разработчика — часто небольшие задачки публикуют представители крупных компаний.\n\nЧто Делать, Если В Моем Городе Нет Вакансий Java Программиста?\nИ наоборот, многие с IT-образованием совершенно не умеют программировать. Конечно, IT-образование и/или наличие сертификатов – это хорошо, но все это мало тебе поможет, если ты не сможешь выполнить тестовое задание. С каждым языком программирования связаны свои технологии. Примерный список технологий для вакансии веб-разработчика приведен на рис. В резюме нужно упоминать лишь те, которые ты действительно освоил, а не просто слышал, что они есть. Если ты знаешь только PHP, HTML, CSS и JavaScript, то их и указывай.\n\nЯ сам знаю многих людей, которые не окончили университет и стали хорошими, высокооплачиваемыми, крутыми программистами. Но людей, которые стали высокооплачиваемыми крутыми программистами, закончив вуз – больше, поэтому тут для меня ответ очень простой. С опытом только удаленной работы и своими проектами отдельная история. Для нас это чаще отрицательный фактор, чем положительный. Мы на образование смотрим всегда.\n\nУровень Зарплаты В Зависимости От Опыта Работы Соискателя\nНо их слишком мало, чтобы полностью покрыть нужды вечно голодного рынка IT-специалистов. А это значит, что у вас всегда есть шанс, эдакий вы авантюрист. Кроме того, у вас появится дополнительная тема для задушевных бесед на . Средний возраст моих студентов около 30 лет. Все уже обжились в своих городах имеют семьи, бабушек, дома и дачи. Переезд в другой город в этой ситуации кажется неразумным.",
      "views": 0,
      "id": 4
    },
    {
      "title": "IT-рынку не хватает 50 тысяч специалистов ежегодно — Федоров",
      "category": "QA",
      "description": "T-рынку не хватает 50 тыс. специалистов ежегодно.  Об этом в ходе презентации дорожной карты реформирования IT-образования во время конференции Synergy. IT Business & IT Education сказал вице-премьер-министр — министр цифровой трансформации Михаил Федоров.",
      "author": "Chingiz",
      "text": "Сейчас, по его словам, украинские вузы выпускают 20 тысяч специалистов в IT-отрасли за год. На сегодня, как отметил Федоров, количество бюджетных мест в сфере подготовки IT-специалистов больше, чем, например, юристов, экономистов.\n\nНо это, по словам Федорова, не решает проблемы, поскольку уровень преподавания математики, информатики в школах, и соответственно результаты ВНО по математике, не способствуют тому, чтобы на обучение в вузы приходили студенты с высоким уровнем базовой подготовки.\n\nТакже Федоров отметил, что для удовлетворения потребностей рынка необходимо изменить и классификатор профессий, который не отражает реальное положение вещей в отрасли IT. Кроме этого для подготовки специалистов необходимо изменить подходы вузов, в частности, предоставить им возможность привлекать к преподаванию практиков, иностранных преподавателей. Это возможно только с предоставлением финансовой автономии высшим учебным заведениям, которые таким образом получат возможность адекватно оплачивать работу соответствующих специалистов.\n\nВице-премьер-министр подчеркнул, что согласно прогнозам к 2030 году IT отрасль потребует до 500−600 тыс специалистов.",
      "views": 1,
      "id": 5
    },
    {
      "title": "Минцифры планирует обновить курс информатики в школах",
      "category": "QA",
      "description": "В Министерстве цифровой трансформации прорабатывают 15 направлений по реформированию IT-образования в Украине.  Среди ключевых – развитие неформального образования в IT, предоставление вузам финансовой автономии для привлечения преподавателей, а также повышение качества преподавания математики и информатики в школах, заявил во время презентации дорожной карты реформирования ІТ-образования на конференции Synergy. IT Business & IT Education вице-премьер, министр цифровой трансформации Михаил Федоров.",
      "author": "Chingiz",
      "text": "«Рабочая группа уже сформировала видение реформы… Ключевые направления, которые мы будем менять, это, во-первых, развитие неформального образования. Второе важное направление – повышение конкурентоспособности и автономности университетов и колледжей. У каждого руководителя учебного заведения должны быть конкретные КPI, должна быть финансовая автономия, для привлечения и использования ресурсов… Повышение качества преподавания математики и информатики в школах. Мы уже нашли средства и работаем над трансформацией предмета информатики, записываем вместе с бизнесом онлайн-курс математики, который будут внедрять в школах”, — рассказал Федоров.\n\nВ бюджете на следующий год предусмотрено 450 млн грн на проект подготовки свитчеров в сфере IT и повышение квалификации учителей информатики.\n\nК этому процессу планируется привлекать крупные и средние компании, имеющие опыт запуска собственных учебных курсов. Также планируется создать для школьников видеокурс математики и обновить предмет «Информатика», развить сетевое образование, которое даст школьникам возможность обучения вне школы.\n\nРанее сообщалось, что Минцифры совместно и Министерство внутренних дел работают над возможностью подачи заявления в полицию в онлайн режиме. О сроках введения функции в работу, пока не сообщается, заявил Михаил Федоров",
      "views": 0,
      "id": 6
    },
    {
      "title": "Универсальный vs узкопрофильный программист. Определяем путь",
      "category": "QA",
      "description": "УНИВЕРСАЛЬНОСТЬ КАК ВЕЧНАЯ ЦЕННОСТЬ Говоря об отличиях человека от других живых видов, едва ли не чаще всего вспоминают о его способности к использованию инструментов. Да, морская выдра разбивает раковину устрицы камнем, а ворона даже может открыть орех, бросив его с высоты, но наш далекий предок, взявший в руки палку, определил дальнейшую судьбу всей планеты. Потому что палка была универсальным инструментом: можно опереться при ходьбе, сбить фрукт с дерева, стукнуть врага или метнуть в добычу, измерить глубину лужи или потыкать в муравейник.",
      "author": "Chingiz",
      "text": "Я уже 35 лет в IT, из них больше 20 — в разработке, в основном в роли играющего тренера. Занимался всеми видами поддержки, информационной безопасностью и построением процессов с обязательным погружением в бизнес заказчика. Преподавал, был ментором, вел тренинги и читал, но самое главное — участвовал в формировании команд, которые могут сделать практически все, причем с удовольствием. Потому что им нравится их работа и нравится работать вместе.\n\nВ DataArt я сейчас на институциональном уровне помогаю строить планы профессионального развития коллег, оценивать их карьерные перспективы и подбирать технологии для освоения. Поэтому проблема противопоставления универсальных знаний глубокому погружению в техническую экспертизу на узком направлении по вполне понятным причинам меня волнует.\n\nВ этой статье попробуем разобраться с понятием универсальности и, наверное, убедить часть коллег в том, что в расширении спектра навыков программиста заинтересованы не только его работодатели. Подозреваю, тема может оказаться дискуссионной, но во многом этим она и интересна. Мне кажется, что задуматься над этой темой в любом случае полезно как начинающим, так и опытным IT-специалистам, которые планируют не только продолжать работу, но и расти в профессии — в том числе карьерно и финансово.",
      "views": 0,
      "id": 7
    },
    {
      "title": "Что такое Node JS. Начало работы",
      "category": "Backend",
      "description": "Загрузим последнюю версию. В моем случае это версия 16.1.0. Для Windows установщик представляет файл с расширением msi. После запуска откроется программа установщика:",
      "author": "Chingiz",
      "text": "Node.js представляет среду выполнения кода на JavaScript, которая построена на основе движка JavaScript Chrome V8, который позволяет транслировать вызовы на языке JavaScript в машинный код. Node.js прежде всего предназначен для создания серверных приложений на языке JavaScript. Хотя также существуют проекты по написанию десктопных приложений (Electron) и даже по созданию кода для микроконтроллеров. Но прежде всего мы говорим о Node.js, как о платформе для создания веб-приложений.\n\nNode.js является открытым проектом, исходники которого можно посмотреть на github.com.\n\nУстановка\nДля загрузки перейдет на официальный сайт https://nodejs.org/en/. На главной странице мы сразу увидим две возможные опции для загрузки: самая последняя версия NodeJS и LTS-версия.",
      "views": 0,
      "id": 8
    },
    {
      "title": "Создание сервера",
      "category": "Backend",
      "description": "Для работы с сервером и протоколом http в Node.js используется модуль http.  Чтобы создать сервер, следует вызвать метод http.createServer():  1 2 3 const http = require(\"http\");   http.createServer().listen(3000);",
      "author": "Chingiz",
      "text": "Метод createServer() возвращает объект http.Server. Но чтобы сервер мог прослушивать и обрабатывать входящие подключения, у объекта сервера необходимо вызвать метод listen(), в который в качестве параметра передается номер порта, по которому запускается сервер.\n\nДля обработки подключений в метод createServer можно передать специальную функцию:\n\n1\n2\n3\n4\n5\n6\nconst http = require(\"http\");\n \nhttp.createServer(function(request, response){\n     \n    response.end(\"Hello world!\");\n}).listen(3000);\nЭта функция принимает два параметра:\n\nrequest: хранит информацию о запросе\n\nresponse: управляет отправкой ответа\n\nRequest\nПараметр request позволяет получить информацию о запросе и представляет объект http.IncomingMessage. Отметим некоторые основные свойства этого объекта:\n\nheaders: возвращает заголовки запроса\n\nmethod: тип запроса (GET, POST, DELETE, PUT)\n\nurl: представляет запрошенный адрес\n\nНапример, определим следующий файл app.js:\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\nvar http = require(\"http\");\n \nhttp.createServer(function(request, response){\n     \n    console.log(\"Url: \" + request.url);\n    console.log(\"Тип запроса: \" + request.method);\n    console.log(\"User-Agent: \" + request.headers[\"user-agent\"]);\n    console.log(\"Все заголовки\");\n    console.log(request.headers);\n     \n    response.end();\n}).listen(3000);\nЗапустим его и обратимся в браузере по адресу http://localhost:3000/index.html:",
      "views": 3,
      "id": 9
    }
  ],
  "users": [
    {
      "firstName": "Chingiz",
      "lastName": "Shigayev",
      "email": "admin@gmail.com",
      "password": "admin123",
      "confirm": "admin123",
      "id": 1
    },
    {
      "firstName": "Chingiz",
      "lastName": "Shigayev",
      "email": "shigayevphone@gmail.com",
      "password": "admin123",
      "confirm": "admin123",
      "id": 2
    }
  ],
  "categories": [
    {
      "title": "Frontend",
      "description": "Данный раздел посвящен различным технологиям веб-программирования. К ним можно отнести HTML5, CSS3, язык JavaScript, платформу Node.js, а также различные фреймворки - jQuery, Angular, React, Vue.js, Ext JS и т.д. В настоящее время подобные технологии быстро развиваются, они дают разработчикам все больше возможностей, а их производительность растет. В итоге уменьшаются преимущества подобных нативных приложений, а разработка все больше уходит в веб-среду.\n\nБез использования специальных библиотек javascript не обходится ни одно крупное веб-приложение. В качестве альтернативы в последнее время все чаще используется язык TypeScript, который компилируется в JavaScript.\n\nТакже существуют различные фреймворки, которые используют JavaScript или TypeScript: Angular, React, Vue.js.\n\nИспользование технологии WebGL дает возможность создавать высокопроизводительные приложения с трехмерной графикой прямо в браузере вне зависимости от целевой платформы.",
      "id": 1
    },
    {
      "title": "Backend",
      "description": "Данный раздел посвящен языку программирования C# и платформе .NET. Доступые подразделы:\n\nОбщая тематика\nПолное руководство по C# 10 и .NET 6\nДанное руководство призвано помочь в короткие сроки освоить все основные концепции языка программирования C#.\n\nПаттерны проектирования\nРуководство раскрывает возможности языка на более высоком уровне и покрывает все основные паттерны проектирования на C#.\n\nСетевое программирование в С# и .NET\nСоздание сетевых приложений (TCP/UDP/HTTP) на C#.\n\nАлгоритмы и структуры данных\nРазбор базовых структур данных и их построение на C#.\n\nВопросы для самопроверки\nВопросы для самопроверки полученных знаний по C#/.NET.\n\nСобеседование по C# и .NET\nВопросы с собеседований по C# и .NET. Уровень - Junior/Middle Developer.",
      "id": 2
    },
    {
      "title": "QA",
      "description": "Что же такое QA и как овладеть профессией тестировщика ПО,чтобы реализовать себя в IT-отрасли?\n\nСамое важное, что нужно сделать перед тем, как вести разговор, что такое Quality Assurance (QA) — это разобраться с терминологией. Большинство не различает между собой термины Quality Assurance (QA), Quality Control (QC) и просто Тестирование, считая их синонимами.\n\nОбеспечение качества (Quality Assurance) — самое широкое из всех понятий и представляет собой совокупность мероприятий, охватывающих абсолютно все этапы разработки, выпуска и эксплуатации программного обеспечения. Это активности на всех этапах жизненного цикла ПО, которые предпринимаются для обеспечения требуемого уровня качества выпускаемого продукта.\n\nКонтроль качества (Quality Control) — это действия, проводимые над продуктом в процессе разработки, для получения информации о его актуальном состоянии: насколько продукт готов и соответствует ли он требованиям качества в каждый конкретный промежуток времени.\n\nТестирование программного обеспечения (Software Testing) — это одна из техник контроля качества, включающая в себя активности по планированию тестовых действий, дизайну тестов, выполнению этих тестов и анализу полученных данных.",
      "id": 3
    }
  ]
}